import React, {Component} from "react";
import {Helmet} from 'react-helmet'
import "./style.css"

class AboutMe extends Component {
  
  render(){
    return (
      <div className="right-side about-me-container">
      <h1 className="about-me-h1">درباره‌ی حسین</h1>
      <p className="about-me-p">
        مداد رنگی ها مشغول بودند به جز مداد سفید، هیچکس به او کار نمیداد، همه
        میگفتند : تو به هیچ دردی نمیخوری، یک شب که مداد رنگی ها تو سیاهی شب گم
        شده بودند، مداد سفید تا صبح ماه کشید مهتاب کشید و انقدر ستاره کشید که
        کوچک و کوچکتر شد صبح توی جعبه مداد رنگی جای خالی او با هیچ رنگی پر نشد،
        به یاد هم باشیم شاید فردا ما هم در کنار هم نباشیم…
        این یک نوشته آزمایشی
        است که به طراحان و برنامه نویسان کمک میکند تا این عزیزان با بهره گیری از
        این نوشته تستی و آزمایشی بتوانند نمونه تکمیل شده از پروژه و طرح خودشان
        را به کارفرما نمایش دهند، استفاده از این متن تستی می تواند سرعت پیشرفت
        پروژه را افزایش دهد، و طراحان به جای تایپ و نگارش متن می توانند تنها با
        یک کپی و پست این متن را در کادرهای مختلف جایگزین نمائید. این نوشته توسط
        سایت لورم ایپسوم فارسی نگاشته شده است.
      </p>
      <Helmet>
        <title>مدیریت فعالیت‌ها | درباره‌ی من</title>
      </Helmet>
    </div>
  );
  }
}
export default AboutMe;
